Gotta003/Triangularization/BLE_p2pMaster/STM32_WPAN/App/app_ble.c
/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  SHCI_CmdStatus_t status;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
     0,                                 /** BleBufferSize not used */
     CFG_BLE_NUM_GATT_ATTRIBUTES,
     CFG_BLE_NUM_GATT_SERVICES,
     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
     CFG_BLE_NUM_LINK,
     CFG_BLE_DATA_LENGTH_EXTENSION,
     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
     CFG_BLE_MBLOCK_COUNT,
     CFG_BLE_MAX_ATT_MTU,
     CFG_BLE_PERIPHERAL_SCA,
     CFG_BLE_CENTRAL_SCA,
     CFG_BLE_LS_SOURCE,
     CFG_BLE_MAX_CONN_EVENT_LENGTH,
     CFG_BLE_HSE_STARTUP_TIME,
     CFG_BLE_VITERBI_MODE,
     CFG_BLE_OPTIONS,
     0,
     CFG_BLE_MAX_COC_INITIATOR_NBR,
     CFG_BLE_MIN_TX_POWER,
     CFG_BLE_MAX_TX_POWER,
     CFG_BLE_RX_MODEL_CONFIG,
     CFG_BLE_MAX_ADV_SET_NBR,
     CFG_BLE_MAX_ADV_DATA_LEN,
     CFG_BLE_TX_PATH_COMPENS,
     CFG_BLE_RX_PATH_COMPENS,
     CFG_BLE_CORE_VERSION,
     CFG_BLE_OPTIONS_EXT,
	 CFG_BLE_MAX_ADD_EATT_BEARERS
    }
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init();

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
  if (status != SHCI_Success)
  {
    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
  }

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
  UTIL_SEQ_RegTask(1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

  /*Radio mask Activity*/
#if (OOB_DEMO != 0)
  ret = aci_hal_set_radio_activity_mask(0x0020);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
  APP_DBG_MSG("\n");
#endif
  /**
   * Initialize P2P Client Application
   */
  P2PC_APP_Init();

  /* USER CODE BEGIN APP_BLE_Init_3 */

  /* USER CODE END APP_BLE_Init_3 */

#if (OOB_DEMO != 0)
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
#endif

#if (OOB_DEMO == 0)
  /**
   * Start scanning
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
#endif
  /* USER CODE BEGIN APP_BLE_Init_2 */
  Scan_Request();
  /* USER CODE END APP_BLE_Init_2 */
  return;
}

/* USER CODE BEGIN PARSE_ADV_REPORT */
/**
 * @brief Parses one advertising report's AD structures, looking for either
 *        the phone's name ("MyPhone") or a dynamic anchor relay name
 *        ("A<id>-<rssi>"), and updates current_rssi_A1/A2/A3 accordingly.
 */
static void Process_Advertising_Report(uint8_t *adv_report_data, uint8_t len_data, int8_t raw_rssi)
{
  uint8_t i = 0;
  while (i < len_data)
  {
    uint8_t ad_len = adv_report_data[i];
    if (ad_len == 0) break;
    if (i + 1 + ad_len > len_data) break;

    uint8_t ad_type = adv_report_data[i + 1];
    if (ad_type == 0x09 || ad_type == 0x08)
    {
      char name_buf[32] = {0};
      uint8_t name_len = ad_len - 1;
      if (name_len > 31) name_len = 31;

      memcpy(name_buf, &adv_report_data[i + 2], name_len);

      if (strcmp(name_buf, "MyPhone") == 0)
      {
        //APP_DBG_MSG("\r\nPHONE RECOGNIZED\n\r");
        static float filtered_rssi = -100.0f;
        static uint8_t first_sample = 1;
        if (first_sample) {
          filtered_rssi = (float)raw_rssi;
          first_sample = 0;
        } else {
          float alpha = 0.2f;
          filtered_rssi = (alpha * (float)raw_rssi) + ((1.0f - alpha) * filtered_rssi);
        }
        current_rssi_A1 = (int8_t)filtered_rssi;
        //APP_DBG_MSG("A%d,%d", ANCHOR_ID, current_rssi_A1);
      }
      else if (name_buf[0] == 'A' && name_buf[1] != '\0')
      {
        /* Anchors format this as "A<id>:<rssi>", e.g. "A2:-70" */
        char* separator = strchr(name_buf, ':');
        if (separator != NULL && separator > &name_buf[1])
        {
          *separator = '\0';
          int parsed_id = atoi(&name_buf[1]);
          /* Take everything after the ':' as the signed RSSI text as-is
           * (e.g. "-70" -> -70). Using an explicit ':' delimiter means we
           * don't have to guess based on the number's own sign. */
          int8_t parsed_rssi = (int8_t)atoi(separator + 1);
          //APP_DBG_MSG("\r\n[DYNAMIC RX] Anchor ID: %d | Remote RSSI: %d\n\r", parsed_id, parsed_rssi);
          if (parsed_id == 2) {
            current_rssi_A2 = parsed_rssi;
          } else if (parsed_id == 3) {
            current_rssi_A3 = parsed_rssi;
          }
        }
        else
        {
          /* USER CODE BEGIN DEBUG_UNMATCHED_A */
          /* Starts with 'A' but no valid "-" separator found - log it raw so we
           * can see the actual format being advertised. */
          APP_DBG_MSG("\r\n[DEBUG] 'A'-prefixed name with no valid separator: \"%s\"\n\r", name_buf);
          /* USER CODE END DEBUG_UNMATCHED_A */
        }
      }
      else
      {
        /* USER CODE BEGIN DEBUG_UNMATCHED_NAME */
        /* Temporary diagnostic: print every other advertised name we see,
         * so we can confirm whether the anchors are advertising at all, and
         * if so, exactly what name string they're using. Remove once the
         * anchor format is confirmed. */
        APP_DBG_MSG("\r\n[DEBUG] Unmatched advertised name: \"%s\"\n\r", name_buf);
        /* USER CODE END DEBUG_UNMATCHED_NAME */
      }
    }
    i += ad_len + 1;
  }
}
/* USER CODE END PARSE_ADV_REPORT */

