Gotta003/Triangularization/BLE_p2pMaster/STM32_WPAN/App/app_ble.c
        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

            /* USER CODE END EVT_LE_CONN_COMPLETE */
            /**
             * The connection is done,
             */
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

            /* CONNECTION WITH CLIENT */
            APP_DBG_MSG("\r\n\r**  CONNECTION COMPLETE EVENT WITH SERVER \n\r");
            handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);

            result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
            if (result == BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
              APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
            }
            else
            {
              APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
            }
            break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

          case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
          		  {
          			uint8_t *adv_report_data;
          			le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

          			uint8_t len_data = le_advertising_event->Advertising_Report[0].Length_Data;
          			adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;

          			int8_t physical_link_rssi = (int8_t)*(uint8_t*)(adv_report_data + len_data);

          			uint8_t i = 0;
          			char name_buf[32] = {0};
          			uint8_t phone_recognized = 0;

          			/* 1. Rilevamento rapido del telefono locale (A1) */
          			while (i < len_data)
          			{
          			  uint8_t ad_len = adv_report_data[i];
          			  if (ad_len == 0) break;
          			  if (i + 1 + ad_len > len_data) break;

          			  uint8_t ad_type = adv_report_data[i + 1];

          			  if (ad_type == 0x08 || ad_type == 0x09)
          			  {
          				uint8_t name_len = ad_len - 1;
          				if (name_len > 31) name_len = 31;
          				memcpy(name_buf, &adv_report_data[i + 2], name_len);
          				if (strcmp(name_buf, "MyPhone") == 0)
          				{
          				  phone_recognized = 1;
          				  break;
          				}
          			  }
          			  i += ad_len + 1;
          			}

          			if (phone_recognized)
          			{
          			  //APP_DBG_MSG("\r\nPHONE RECOGNIZED\n\r");
          			  static float filtered_rssi = -100.0f;
          			  static uint8_t first_sample = 1;
          			  if (first_sample) {
          				  filtered_rssi = (float)physical_link_rssi;
          				  first_sample = 0;
          			  }
          			  else {
          				  float alpha = 0.2f;
          				  filtered_rssi = (alpha * (float)physical_link_rssi) + ((1.0f - alpha) * filtered_rssi);
          			  }
          			  current_rssi_A1 = (int8_t)filtered_rssi;
          			}
          			/* 2. Decodifica universale dei dati di servizio P2P delle ancore */
          			else
          			{
          			  i = 0;
          			  while (i < len_data)
          			  {
          				uint8_t ad_len = adv_report_data[i];
          				if (ad_len == 0) break;
          				if (i + 1 + ad_len > len_data) break;

          				uint8_t ad_type = adv_report_data[i + 1];

          				/* Identifichiamo i Service Data (0x16) con UUID ST P2P (0xFE2C) */
          				if (ad_type == 0x16 && adv_report_data[i + 2] == 0x2C && adv_report_data[i + 3] == 0xFE)
          				{
          					/*APP_DBG_MSG("\r\n[P2P] RX payload: ");
							for (int j = 0; j <= ad_len; j++) {
								APP_DBG_MSG("%02X ", adv_report_data[i + j]);
							}
							APP_DBG_MSG("\n");*/
          				  /* Estraiamo l'ID e l'RSSI direttamente in base alla lunghezza del payload ricevuto */
          				  if (ad_len >= 12)
          				  {
          					// Se l'ancora ha inviato 13 byte (ad_len = 12), i nostri dati custom sono gli ultimi due byte
          					int parsed_id = (int)adv_report_data[i + ad_len - 1]; // Penultimo byte
          					int8_t extracted_rssi = (int8_t)adv_report_data[i + ad_len]; // Ultimo byte

          					if (parsed_id == 2 || parsed_id == 3)
          					{
          					  if (extracted_rssi < 0 && extracted_rssi > -120)
          					  {
          						//APP_DBG_MSG("\r\n[DYNAMIC RX] Anchor ID: %d | Remote Phone RSSI: %d\n\r", parsed_id, extracted_rssi);
          						if (parsed_id == 2) {
          						  current_rssi_A2 = extracted_rssi;
          						} else {
          						  current_rssi_A3 = extracted_rssi;
          						}
          					  }
          					}
          				  }
          				}
          				i += ad_len + 1;
          			  }
          			}
          		  }
          		  break;

          /* USER CODE BEGIN META_EVT */

          /* USER CODE END META_EVT */

          default:
            /* USER CODE BEGIN subevent_default */

            /* USER CODE END subevent_default */
            break;
        }
      }
      break; /* HCI_LE_META_EVT_CODE */

    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN evt_default */

      /* USER CODE END evt_default */
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

